{
  "add_new_validate_require": {
    "message": "Please enter the Domain (URI)",
    "description": "Validation message displayed when the Domain (URI) field is empty"
  },
  "add_new_validate_min_length": {
    "message": "Please enter the Domain (URI) with at least 3 characters.",
    "description": "Validation message displayed when the Domain (URI) field has fewer than 3 characters"
  },
  "add_new_validate_invalid_domain": {
    "message": "Please enter a valid Domain (URI)",
    "description": "Validation message displayed when the Domain (URI) entered is invalid"
  },
  "add_new_validate_card_name_required": {
    "message": "Card name is required",
    "description": "Validation message displayed when the Card Name field is empty"
  },
  "add_new_validate_card_name_length": {
    "message": "Card name must be less than 256 characters",
    "description": "Validation message displayed when the Card Name field exceeds 255 characters"
  },
  "add_new_validate_cardholder_length": {
    "message": "Cardholder must be less than 256 characters",
    "description": "Validation message displayed when the Cardholder field exceeds 255 characters"
  },
  "add_new_validate_card_number_invalid": {
    "message": "Card number is invalid",
    "description": "Validation message displayed when the Card Number field is invalid"
  },
  "add_new_validate_expiration_date_invalid": {
    "message": "Expiration date is invalid",
    "description": "Validation message displayed when the Expiration Date field is invalid"
  },
  "add_new_validate_security_code_invalid": {
    "message": "Security code must be 3 or 4 digits",
    "description": "Validation message displayed when the Security Code field is invalid"
  },
  "add_new_security_code_too_long": {
    "message": "Security code is invalid.",
    "description": "Warning message displayed when the security code has 4 digits but the detected card issuer requires 3 digits"
  },
  "add_new_header": {
    "message": "Adding a new ITEM to \n2FAS Pass",
    "description": "Header for the section to add a new item"
  },
  "add_new_subheader": {
    "message": "Start the process here and continue in the mobile app.",
    "description": "Subheader explaining that the process starts in the browser and continues in the mobile app"
  },
  "add_new_learn_more_tooltip_header": {
    "message": "Security is our priority",
    "description": "Header for the tooltip explaining security measures"
  },
  "add_new_learn_more_tooltip_content_1": {
    "message": "By default, we do not ask you to enter your username and create a password using the Browser Extension. Instead, we encourage you to choose a username and generate a password directly in the mobile application.",
    "description": "Explains the default security approach of creating login and password in the mobile app"
  },
  "add_new_learn_more_tooltip_content_2": {
    "message": "You can enter your username and/or password in the form above and save it to your Vault in the mobile app.",
    "description": "Explains the option to enter login and password in the browser extension and save it to the mobile app"
  }
}